'''
想法：可以先在这里定义好文档各级标题的具体内容，这样即使换一个内容不同但格式相似的文档，只要修改这里的标题，原脚本就仍能正确切分文档
'''
# 1. 总标题
DOC_TITLE_BLACKBALL = "灵山胜境：历史、文化、景点特色与个性化游览指南.docx" 


# 2. 章节标题（父模块触发词）
CHAPTER_HEADERS = [ 
    "景区概况与千年历史渊源",
    "核心文化内涵：佛教传承与艺术融合的典范",
    "核心景点特色详解：佛教艺术的殿堂",
    "个性化游览路线推荐：深度体验灵山胜境",
    "实用游览贴士：全方位保障你的灵山之旅"
    ]

# 3. 子模块触发词
SUB_BLOCK_TRIGGERS = [ 
    "路线规划", "讲解重点", "特色体验", 
    "餐饮", "住宿", "季节选择", "时间安排", 
    "表演时间", "穿着舒适", "携带物品", "导游服务", "文明游览"
    ]

# 4. 分类
CATEGORY_MAP = {
    "历史文化爱好者路线": "游览路线",
    "自然风光爱好者路线": "游览路线",
    "亲子家庭路线":       "游览路线",
    "灵山大佛":           "景点介绍",
    "灵山梵宫":           "景点介绍",
    "九龙灌浴":           "景点介绍",
    "五印坛城":           "景点介绍",
    "祥符禅寺":           "景点介绍",
    "门票与优惠政策":     "实用信息",
    "最佳游览时间":       "实用信息",
    "餐饮与住宿推荐":     "实用信息",
    "其他实用建议":       "实用信息",
}